Courses/7140/Lectures/Overview/math-logic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Overview of Background in Discrete Mathematics and Logic</title>
<!-- 2016-02-11 Thu 17:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Overview of Background in Discrete Mathematics and Logic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Sets, Bags, Tuples and Sequences</a>
<ul>
<li><a href="#sec-1-1">1.1. Sets</a></li>
<li><a href="#sec-1-2">1.2. Bags</a></li>
<li><a href="#sec-1-3">1.3. Sequences</a></li>
<li><a href="#sec-1-4">1.4. Tuples</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Tables</a></li>
<li><a href="#sec-3">3. Functions and Relations</a></li>
<li><a href="#sec-4">4. Propositions</a></li>
<li><a href="#sec-5">5. Predicates</a></li>
<li><a href="#sec-6">6. A implies B (A =&gt; B)</a>
<ul>
<li><a href="#sec-6-1">6.1. Propositions A, B:  A =&gt; B</a></li>
<li><a href="#sec-6-2">6.2. Predicates A, B:  A =&gt; B</a></li>
<li><a href="#sec-6-3">6.3. For-All/ There-Exists P(x)</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Weaker/Stronger Predicates</a></li>
</ul>
</div>
</div>
<p>
Abstract: This article is a collection of notes on what students of
Software Engineering (undergrad or grad) should know.  It is assumed
that a sophomore level course in Discrete Mathematics and Logic was
taken.  I am refraining from describing notations.  As we use these
ideas in our course, I will explain the notations.  [New entries will
be added as I discover what the students are unclear about.]
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sets, Bags, Tuples and Sequences</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Sets</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Sets are collections of items.
</li>

<li>In math, a set can be a collection of dissimilar things such as a
set of an orange, an elephant, a human, and a stone.
</li>

<li>In CS, our sets are (almost always) of values from a given type.
E.g., a set of characters.
</li>

<li>In a set, there is no notion of duplication.  A given item is or is
not in a set.  Some times, we may post the question: How many times
does i appear in S?  The answer can only be a 0 or 1.
</li>

<li>In a set, there is no notion of order.  So, you can jumble up a
set.
</li>

<li>Empty sets are highly useful.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Bags</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Bags are like sets, except there is a notion of duplication.
</li>
<li>The Q "How many times does i appear in a bag B?  The answer can be
a 0, 1 or higher.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Sequences</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Sequences are like bags, except there is a notion of order.
</li>
<li>So, there is a first, second, &#x2026;, last item of a seq Q.
</li>
<li>The question "How many times does i appear in a seq Q?  The answer can be
a 0, 1 or higher.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Tuples</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Tuples are like sequences, but need not be of like values.  They
can be dissimilar.  In CS, these also by the names of "records",
structs, and "data members" (of a class).
</li>
<li>In our use, there is a first, second, &#x2026;, last item of a tuple T.
</li>
<li>Equally frequently, instead of first, second, &#x2026;, we may name the
"fields" of a tuple T (like  "data members" of a class).
</li>
<li>Tuples can be empty too!
</li>
<li>Tuples to seq conversion is "ok" only if all items were of the same
type.
</li>
<li>Seq to tuples conversion is as expected.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tables</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Tables are sets of tuples, all of a given length.  Thus, we can
visualize a table as columns of rows.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Functions and Relations</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>A relation maps elements of its <i>domain</i> set into elements of its
<i>range</i> set.
</li>

<li>When a relation is such that no element is mapped to more than one
element in the range, it becomes <i>function</i>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Propositions</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>True and False are propositions.
</li>

<li>For other propositions, we often use letters.  These are assigned a
True or False value in an interpretation.
</li>

<li>A formula involves these things and the and (^) or (v) not (~)
symbols also.  A well-formed-formula (wff) is defined
synatctically.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Predicates</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Ex: x &gt; 1 is a predicate.  It has one free variable, x.  In the
programming context, think of free variables as globally scoped
variables.
</li>

<li>Predicates can involve for-all and there-exists quantifiers.
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> A implies B (A =&gt; B)</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Propositions A, B:  A =&gt; B</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>A implies B is often written as A =&gt; B.
</li>

<li>By def, same as <code>not A or B</code>.  Hence, 
<ol class="org-ol">
<li>A =&gt; A,
</li>
<li>(False =&gt; B) is true for arbitrary B.
</li>
<li>(True <code>&gt; B) only if B =</code> True.  It is false otherwise.
</li>
<li>WhatEver =&gt; True.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Predicates A, B:  A =&gt; B</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>In CS, it is highly useful to use attributes of size to A and B.
Suppose we already know that A =&gt; B.  Consider: The size of the set
of values, #A, that make A true versus the size #B of the set of
values that make B true.  Is #A &gt;= #B?  Assume that both of these
are finite numbers.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> For-All/ There-Exists P(x)</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li>The domain X of x is/ ought-to-be clear from the context.
</li>
<li><code>for-all x: P(x)</code> is the and-ing of P(a) for all a in X.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Weaker/Stronger Predicates</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>If A =&gt; B we say A is stronger than B. Assuming A ! = B.  We can
reverse: B is weaker than A.
</li>

<li>Simple example on predicates: x &gt; 7 implies x &gt; 1.
</li>

<li>Consider:  P implies Q  (also written as P =&gt; Q)
</li>

<li>We say that P is stronger than Q.  Alt: Q is weaker than P.

<ol class="org-ol">
<li>P and Q, in general, have free variables, x, y, z, &#x2026; Consider
a particular assignment A of values for each of x, y, z that
make P come out True.  A will also make Q True.
</li>
</ol>
</li>

<li>In the context of programming, we can refer to this A as a "state".
</li>

<li>Let C(Q) be the collection of such assignment of values that make Q
come out as True.
<ol class="org-ol">
<li>Let C(P) be the collection of such values that make P come out as True.
</li>

<li>C(P) is a subset of C(Q)
</li>

<li>If C(P) = C(Q), P is equivalent to Q (also written as P &amp;hArr; Q,
or P &amp;equiv; Q).
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-11
</div>
</body>
</html>
